# pandas
* series
* dataframe

In [3]:
l1 = ['a','b','c','d']
display(l1)
display(type(l1))

['a', 'b', 'c', 'd']

list

In [2]:
import pandas as pd

In [5]:
# list

l1 = ['a','b','c','d']
display(l1)
display(type(l1))
print('============')
s1 = pd.Series(l1)
display(s1)
display(type(s1))

['a', 'b', 'c', 'd']

list

============

0    a
1    b
2    c
3    d
dtype: object

pandas.core.series.Series

In [6]:
s1

0    a
1    b
2    c
3    d
dtype: object

In [8]:
s2 = pd.Series([1,2,3,5])
s2

0    1
1    2
2    3
3    5
dtype: int64

In [7]:
l1

['a', 'b', 'c', 'd']

In [9]:
# tuple
t1 = (1,7,8,9,10.2,78)
s1 = pd.Series(t1)

display(s1)
display(type(s1))

0     1.0
1     7.0
2     8.0
3     9.0
4    10.2
5    78.0
dtype: float64

pandas.core.series.Series

In [10]:
# Dictionary
d1 = {
    'a':1,
    'b': 'pakistan',
    'c':20,
    'd':100
}

s1 = pd.Series(d1)
s1

a           1
b    pakistan
c          20
d         100
dtype: object

In [11]:
k = ['a','b','c']
v = [100,200,300]


s1 = pd.Series(data=v, index=k)
display(s1)
s1 = pd.Series(v,k)
display(s1)

a    100
b    200
c    300
dtype: int64

a    100
b    200
c    300
dtype: int64

In [17]:
s2 = pd.Series([1,2,3,5], name='rollnumber')
s2

0    1
1    2
2    3
3    5
Name: rollnumber, dtype: int64

In [18]:
display(s2.index)
display(s2.values)
display(s2.name)

RangeIndex(start=0, stop=4, step=1)

array([1, 2, 3, 5])

'rollnumber'

dir(s2)

In [ ]:
create series 
* list
* tuple
* dictionary
* key,value pass in index and value argument

# DataFrame

In [20]:
data = [[1,2,3],
       [4,5,6],
       [7,8,9]]

display(data)
print(type(data))

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

<class 'list'>

In [22]:
data = [[1,2,3],
       [4,5,6],
       [7,8,9]]

df = pd.DataFrame(data) # list of list
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [44]:
data = [[1,2,3],
       [4,5,6],
       [7,8,9]]

df = pd.DataFrame(data,
                  columns = ['id','name','course']) # list of list
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

   id  name  course
0   1     2       3
1   4     5       6
2   7     8       9

In [45]:
data = [[1,2,3],
       [4,5,6],
       [7,8,9]]

df = pd.DataFrame(data,
                  columns = ['id','name','course'],
                 index=['a','b','c']) # list of list
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

   id  name  course
a   1     2       3
b   4     5       6
c   7     8       9

In [23]:
data = ((1,2,3),
       (4,5,6),
       (7,8,9))

df = pd.DataFrame(data) # list of list
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [25]:
import numpy as np

data = np.random.randint(1,100, size=(10,10))
data

array([[ 4,  9, 50, 95,  7, 63, 10, 84, 20, 30],
       [20, 25, 93, 87, 61, 35, 33, 12, 18,  4],
       [66, 56, 61, 47, 17, 28, 41, 73, 99, 19],
       [ 6, 61, 96, 92, 54, 71, 77, 60, 26, 48],
       [79, 25, 95, 35, 34, 83, 52, 30, 92, 61],
       [65, 26, 38, 53, 29, 51,  6, 20, 99, 40],
       [83, 98, 89, 86, 63, 28, 12, 31, 56, 54],
       [81, 42, 38, 84, 62, 66, 82,  5, 14, 88],
       [77, 62, 81, 17, 94,  7, 11, 95, 40, 67],
       [11, 67, 72, 46, 76, 89, 71, 11,  8, 77]])

In [27]:
data = np.random.randint(1,100, size=(10,10))

df = pd.DataFrame(data)
df

    0   1   2   3   4   5   6   7   8   9
0  99   7  58   9   4   5  83  19  76   8
1  71  53   9  50  98  86  88  99  73  38
2  73  70  21  21  76  47  64  91  42  41
3  50  84  53  90  84  50   3  33   7  25
4  97  54  63  51  91  55   2   8  11  34
5  14  78  17   7   2  87  10  30  47  63
6  99  15  20  10  10  82  45  88  47  26
7  12  55  98   2  46  33  87  50  17  54
8   6  71  61  29  71  62  81  61   8   9
9  52  46  38  88  53  92  22  91  71   7

# create dataframe with dictionary

In [47]:
d1 = {
    "id":[1,2,3],
    "name":['Hamza',"Asif",'Junaid'],
    'NED course':['AI',"DataVisualization",'DS']
}
display(d1)

df = pd.DataFrame(d1)
df

{'id': [1, 2, 3],
 'name': ['Hamza', 'Asif', 'Junaid'],
 'NED course': ['AI', 'DataVisualization', 'DS']}

   id    name         NED course
0   1   Hamza                 AI
1   2    Asif  DataVisualization
2   3  Junaid                 DS

# extract columns from dataframe

* dataframe.column_name
    * space not allowed in column name
    * we can't add new column
* dataframe['column name']

In [48]:
display(df)
print(type(df))
sid = df.id

print(type(sid), )
sid

   id    name         NED course
0   1   Hamza                 AI
1   2    Asif  DataVisualization
2   3  Junaid                 DS

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

0    1
1    2
2    3
Name: id, dtype: int64

In [49]:
display(df)

sname = df.name

sname

   id    name         NED course
0   1   Hamza                 AI
1   2    Asif  DataVisualization
2   3  Junaid                 DS

0     Hamza
1      Asif
2    Junaid
Name: name, dtype: object

In [50]:
display(df)

scourse = df.NED course
scourse

SyntaxError: invalid syntax (<ipython-input-50-9dd94fc3cd02>, line 3)

In [51]:
display(df)

scourse = df['NED course']
scourse

   id    name         NED course
0   1   Hamza                 AI
1   2    Asif  DataVisualization
2   3  Junaid                 DS

0                   AI
1    DataVisualization
2                   DS
Name: NED course, dtype: object

In [52]:
df.Timing = '1PM to 3PM' # add new column

df

   id    name         NED course
0   1   Hamza                 AI
1   2    Asif  DataVisualization
2   3  Junaid                 DS

In [53]:
df.id = [100,200,300] # add new column

df

    id    name         NED course
0  100   Hamza                 AI
1  200    Asif  DataVisualization
2  300  Junaid                 DS

In [54]:
df['Timing'] = "1 PM to 3PM"
df

    id    name         NED course       Timing
0  100   Hamza                 AI  1 PM to 3PM
1  200    Asif  DataVisualization  1 PM to 3PM
2  300  Junaid                 DS  1 PM to 3PM

In [55]:
df.values

array([[100, 'Hamza', 'AI', '1 PM to 3PM'],
       [200, 'Asif', 'DataVisualization', '1 PM to 3PM'],
       [300, 'Junaid', 'DS', '1 PM to 3PM']], dtype=object)

In [56]:
df.columns

Index(['id', 'name', 'NED course', 'Timing'], dtype='object')

In [57]:
df.index

RangeIndex(start=0, stop=3, step=1)

# extrace morethan one columns

In [ ]:
dataframe[list_of_columns]

In [58]:
df.columns

Index(['id', 'name', 'NED course', 'Timing'], dtype='object')

In [61]:
df[['Timing','id','name']]

        Timing   id    name
0  1 PM to 3PM  100   Hamza
1  1 PM to 3PM  200    Asif
2  1 PM to 3PM  300  Junaid

In [62]:
cols = ['Timing','id','name']
df[cols]

        Timing   id    name
0  1 PM to 3PM  100   Hamza
1  1 PM to 3PM  200    Asif
2  1 PM to 3PM  300  Junaid

In [63]:
s1 = df.id
type(s1)

pandas.core.series.Series

In [67]:
s1 = df['id']
type(s1)

pandas.core.series.Series

In [68]:
s1 = df[['id']]
type(s1)

pandas.core.frame.DataFrame

In [65]:
df

    id    name         NED course       Timing
0  100   Hamza                 AI  1 PM to 3PM
1  200    Asif  DataVisualization  1 PM to 3PM
2  300  Junaid                 DS  1 PM to 3PM

In [66]:
df1 = df[['NED course','id']]
print(type(df1))

<class 'pandas.core.frame.DataFrame'>

# Create data using numpy pandas
## Class5 dated: 14-May-2023

In [24]:
def random_date():
   
    month = np.random.randint(1,12)
    if month==2:
         day = np.random.randint(1,28)
    else:
         day = np.random.randint(1,31)
    year  = np.random.randint(1950,2015)
    dt = pd.to_datetime(f"{year}-{month}-{day}")
    return dt
    
random_date()

Timestamp('1959-10-09 00:00:00')

In [45]:
import pandas as pd
import numpy as np

no_of_records = 1000
df1 = pd.DataFrame(
    {
        "rollno":np.arange(1,no_of_records+1),
        'name': np.random.choice(['Ali','Hamza','Junaid',"Asif"],no_of_records),
        'fname': np.random.choice(['Ali','Hamza','Junaid',"Asif"],no_of_records),
        'course': np.random.choice(['AI','DS','ML',"Blockchain"],no_of_records),
        'city': np.random.choice(['KHI','ISL','LHR',None],no_of_records),
        'dob': [random_date() for i in range(no_of_records)],
        's1': np.random.randint(1,100, no_of_records),
        's2': np.random.randint(1,100, no_of_records),
        's3': np.random.randint(1,100, no_of_records),
        's4': np.random.randint(1,100, no_of_records),
        's5': np.random.randint(1,100, no_of_records),
        

    }
)

df1

     rollno    name   fname      course  city        dob  s1  s2  s3  s4  s5
0         1   Hamza    Asif          AI  None 1951-09-22  89  99  59  99  62
1         2   Hamza  Junaid          DS   LHR 1989-03-17  92   6  97  74  10
2         3  Junaid    Asif  Blockchain   KHI 1964-05-02  49  37  43  98  24
3         4    Asif    Asif          DS  None 1993-06-14  98  32  52  37  45
4         5    Asif     Ali          AI   ISL 1982-03-07  72  33   7  35  78
..      ...     ...     ...         ...   ...        ...  ..  ..  ..  ..  ..
995     996  Junaid  Junaid          ML   LHR 1958-08-20  44  68  58  11   9
996     997   Hamza  Junaid          AI  None 1986-05-29  18  15  78  59  84
997     998   Hamza    Asif          AI   LHR 1963-11-28  34  16  92  26  70
998     999    Asif  Junaid          ML   ISL 1998-08-19  29  33  68  41   4
999    1000     Ali   Hamza          AI  None 1968-01-02  65  55  89  70  73

[1000 rows x 11 columns]

# EDA

In [46]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   rollno  1000 non-null   int64
 1   name    1000 non-null   object
 2   fname   1000 non-null   object
 3   course  1000 non-null   object
 4   city    751 non-null    object
 5   dob     1000 non-null   datetime64[ns]
 6   s1      1000 non-null   int64
 7   s2      1000 non-null   int64
 8   s3      1000 non-null   int64
 9   s4      1000 non-null   int64
 10  s5      1000 non-null   int64
dtypes: datetime64[ns](1), int64(6), object(4)
memory usage: 86.1+ KB

In [27]:
df1.describe()

,rollno,s1,s2,s3,s4,s5
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,500.500000,50.098000,50.247000,51.168000,48.503000,49.844000
std,288.819436,28.384363,28.616829,28.687083,28.168199,28.972488
min,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000
25%,250.750000,24.000000,25.000000,27.000000,24.000000,24.000000
50%,500.500000,51.000000,51.000000,52.000000,48.000000,51.000000
75%,750.250000,74.000000,75.000000,77.000000,72.000000,75.000000
max,1000.000000,99.000000,99.000000,99.000000,99.000000,99.000000

In [33]:
1000*34/100

340.0

<img src="https://www.scribbr.de/wp-content/uploads/2023/01/Standard-normal-distribution.webp">

In [32]:
d = np.array([1,2,7,5,9,10,2,1000])
# average/mean
#     avg = sum(all value) / total counts

print((1+2+7+5+9+10+2+1000)/8)

129.5

In [ ]:
Step1 Median
data = [1,2,7,5,9,10,2]
sort = [1,2,2,5,7,9,10] # count odd = Media = 5

[1,2,7,5,9,10,2,1000]
[1,2,2,5,7,9,10,1000] # even 5+7/2 = 6

In [ ]:
Mode = most repeated number
[1,2,7,5,9,10,2] = 2

<img src="">

In [42]:
s1 = pd.Series([1,2,7,5,9,10,2])
print(s1)
print("Mode",s1.mode().values[0])
print("Mean/Average",s1.mean())
print("Median",s1.median())

0     1
1     2
2     7
3     5
4     9
5    10
6     2
dtype: int64
Mode 2
Mean/Average 5.142857142857143
Median 5.0

In [48]:
df1.notnull().sum()

rollno    1000
name      1000
fname     1000
course    1000
city       751
dob       1000
s1        1000
s2        1000
s3        1000
s4        1000
s5        1000
dtype: int64

In [50]:
df1.isnull().sum()

rollno      0
name        0
fname       0
course      0
city      249
dob         0
s1          0
s2          0
s3          0
s4          0
s5          0
dtype: int64

In [53]:
df1.notnull().sum()/len(df1)*100

rollno    100.0
name      100.0
fname     100.0
course    100.0
city       75.1
dob       100.0
s1        100.0
s2        100.0
s3        100.0
s4        100.0
s5        100.0
dtype: float64

In [55]:
df1.dtypes

rollno             int64
name              object
fname             object
course            object
city              object
dob       datetime64[ns]
s1                 int64
s2                 int64
s3                 int64
s4                 int64
s5                 int64
dtype: object

In [58]:
df1.to_excel("f1.xlsx", index=False)
df1.to_csv("f1.csv", index=False)

In [57]:
df2 = pd.read_excel("./f1.xlsx")
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   rollno  1000 non-null   int64
 1   name    1000 non-null   object
 2   fname   1000 non-null   object
 3   course  1000 non-null   object
 4   city    751 non-null    object
 5   dob     1000 non-null   datetime64[ns]
 6   s1      1000 non-null   int64
 7   s2      1000 non-null   int64
 8   s3      1000 non-null   int64
 9   s4      1000 non-null   int64
 10  s5      1000 non-null   int64
dtypes: datetime64[ns](1), int64(6), object(4)
memory usage: 86.1+ KB

In [60]:
df3 = pd.read_csv("./f1.csv", dtype=str)
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   rollno  1000 non-null   object
 1   name    1000 non-null   object
 2   fname   1000 non-null   object
 3   course  1000 non-null   object
 4   city    751 non-null    object
 5   dob     1000 non-null   object
 6   s1      1000 non-null   object
 7   s2      1000 non-null   object
 8   s3      1000 non-null   object
 9   s4      1000 non-null   object
 10  s5      1000 non-null   object
dtypes: object(11)
memory usage: 86.1+ KB

In [70]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   rollno  1000 non-null   object
 1   name    1000 non-null   object
 2   fname   1000 non-null   object
 3   course  1000 non-null   object
 4   city    751 non-null    object
 5   dob     1000 non-null   datetime64[ns]
 6   s1      1000 non-null   int32
 7   s2      1000 non-null   int32
 8   s3      1000 non-null   int32
 9   s4      1000 non-null   int32
 10  s5      1000 non-null   int32
dtypes: datetime64[ns](1), int32(5), object(5)
memory usage: 66.5+ KB

# Type casting in Pandas

In [69]:
df3.s1 = df3.s1.astype(np.int32)
df3.s2 = df3.s2.astype(np.int32)
df3.s3 = df3.s3.astype(np.int32)
df3.s4 = df3.s4.astype(np.int32)
df3.s5 = df3.s5.astype(np.int32)

df3['dob'] = pd.to_datetime(df3['dob'])

In [63]:
df1.s5

0      62
1      10
2      24
3      45
4      78
       ..
995     9
996    84
997    70
998     4
999    73
Name: s5, Length: 1000, dtype: int64

In [71]:
df1

     rollno    name   fname      course  city        dob  s1  s2  s3  s4  s5
0         1   Hamza    Asif          AI  None 1951-09-22  89  99  59  99  62
1         2   Hamza  Junaid          DS   LHR 1989-03-17  92   6  97  74  10
2         3  Junaid    Asif  Blockchain   KHI 1964-05-02  49  37  43  98  24
3         4    Asif    Asif          DS  None 1993-06-14  98  32  52  37  45
4         5    Asif     Ali          AI   ISL 1982-03-07  72  33   7  35  78
..      ...     ...     ...         ...   ...        ...  ..  ..  ..  ..  ..
995     996  Junaid  Junaid          ML   LHR 1958-08-20  44  68  58  11   9
996     997   Hamza  Junaid          AI  None 1986-05-29  18  15  78  59  84
997     998   Hamza    Asif          AI   LHR 1963-11-28  34  16  92  26  70
998     999    Asif  Junaid          ML   ISL 1998-08-19  29  33  68  41   4
999    1000     Ali   Hamza          AI  None 1968-01-02  65  55  89  70  73

[1000 rows x 11 columns]

In [76]:
df1['obtained marks'] = df1.s1 + df1.s2 + df1.s3 + df1.s4 + df1.s5
df1['percentage'] = df1['obtained marks']/500*100
df1

,rollno,name,fname,course,city,dob,s1,s2,s3,s4,s5,obtained marks,percentage
0,1,Hamza,Asif,AI,None,1951-09-22,89,99,59,99,62,408,81.6
1,2,Hamza,Junaid,DS,LHR,1989-03-17,92,6,97,74,10,279,55.8
2,3,Junaid,Asif,Blockchain,KHI,1964-05-02,49,37,43,98,24,251,50.2
3,4,Asif,Asif,DS,None,1993-06-14,98,32,52,37,45,264,52.8
4,5,Asif,Ali,AI,ISL,1982-03-07,72,33,7,35,78,225,45.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Junaid,Junaid,ML,LHR,1958-08-20,44,68,58,11,9,190,38.0
996,997,Hamza,Junaid,AI,None,1986-05-29,18,15,78,59,84,254,50.8
997,998,Hamza,Asif,AI,LHR,1963-11-28,34,16,92,26,70,238,47.6
998,999,Asif,Junaid,ML,ISL,1998-08-19,29,33,68,41,4,175,35.0
999,1000,Ali,Hamza,AI,None,1968-01-02,65,55,89,70,73,352,70.4

# apply custom function on series

In [77]:
def grade(per):
    grade = None
    if per>=80:
        grade = "A+"
    elif per>=70:
        grade = "A"
    elif per>=60:
        grade = "B"
    elif per>=50:
        grade = "C"
    else:
        grade = "Fail"
        
    return grade
grade(78)

'A'

In [78]:
df1['Grade'] = df1['percentage'].apply(grade)
df1

,rollno,name,fname,course,city,dob,s1,s2,s3,s4,s5,obtained marks,percentage,Grade
0,1,Hamza,Asif,AI,None,1951-09-22,89,99,59,99,62,408,81.6,A+
1,2,Hamza,Junaid,DS,LHR,1989-03-17,92,6,97,74,10,279,55.8,C
2,3,Junaid,Asif,Blockchain,KHI,1964-05-02,49,37,43,98,24,251,50.2,C
3,4,Asif,Asif,DS,None,1993-06-14,98,32,52,37,45,264,52.8,C
4,5,Asif,Ali,AI,ISL,1982-03-07,72,33,7,35,78,225,45.0,Fail
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Junaid,Junaid,ML,LHR,1958-08-20,44,68,58,11,9,190,38.0,Fail
996,997,Hamza,Junaid,AI,None,1986-05-29,18,15,78,59,84,254,50.8,C
997,998,Hamza,Asif,AI,LHR,1963-11-28,34,16,92,26,70,238,47.6,Fail
998,999,Asif,Junaid,ML,ISL,1998-08-19,29,33,68,41,4,175,35.0,Fail
999,1000,Ali,Hamza,AI,None,1968-01-02,65,55,89,70,73,352,70.4,A